In [136]:
import os
import json

import pandas as pd
import numpy as np

In [137]:
import os

raw_data = []
for filename in os.listdir('./data/return-data'):
    if filename.endswith(".txt"):
        with open('./data/return-data/2017-01-23.txt', 'r') as file:
            for row in file:
                line = json.loads(row)
                raw_data.append(line)

In [138]:
df = pd.DataFrame.from_dict(raw_data)

In [139]:
df.basket.values

array([list([2, 4, 4, 0, 2, 4, 2, 3, 0, 3, 0, 2, 5]),
       list([4, 3, 4, 1, 4, 4]), list([1, 2, 4, 3, 4, 2]), ...,
       list([2, 4, 4, 1]), list([1, 3, 1, 1, 5, 0]),
       list([0, 4, 4, 3, 1, 3, 0, 0, 3])], dtype=object)

In [140]:
df['num_items'] = df.basket.apply(lambda row: len(row))

In [141]:
def count_items_from_category(lst, category_num):
    return sum(i for i in lst if i == category_num)

In [142]:
for i in range(0,6):
    df['category_'+str(i)] = df.basket.apply(lambda row: sum(1 for j in row if j==i))

In [143]:
df.drop(columns=['basket'], inplace=True)

In [144]:
df.head()

,transactionId,zipCode,totalAmount,returnLabel,num_items,category_0,category_1,category_2,category_3,category_4,category_5
0,3712732600,4552,949,0,13,3,0,4,2,3,1
1,8741527373,4276,354,1,6,0,1,0,1,4,0
2,6028409581,1303,318,0,6,0,1,2,1,2,0
3,5970458772,2043,66,0,2,0,1,0,1,0,0
4,6095768367,6552,434,0,7,1,1,2,0,1,2

In [145]:
df.shape

(31000, 11)

In [146]:
df.transactionId.nunique()

1000

In [147]:
df.drop(columns=['transactionId'], inplace=True)

In [148]:
df = df[['returnLabel','zipCode', 'totalAmount', 'num_items', 'category_0',
       'category_1', 'category_2', 'category_3', 'category_4', 'category_5']]

In [150]:
dummy = pd.get_dummies(df.zipCode)

In [151]:
df = df.merge(dummy, how='inner', left_index=True, right_index=True).drop(columns='zipCode')

In [152]:
df.head()

,returnLabel,totalAmount,num_items,category_0,category_1,category_2,category_3,category_4,category_5,1003,...,9993,10612,10783,11974,12272,12286,14850,16928,17432,19495
0,0,949,13,3,0,4,2,3,1,0,...,0,0,0,0,0,0,0,0,0,0
1,1,354,6,0,1,0,1,4,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,318,6,0,1,2,1,2,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,66,2,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,434,7,1,1,2,0,1,2,0,...,0,0,0,0,0,0,0,0,0,0

In [153]:
df.to_csv('./data/cleaned_with_fetures')